misterniark/Meshpay-V2/sdkconfig.defaults.h752
# LilyGo T5 E-Paper S3 Pro 4.7 H752 profile.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# H752 LoRa reset/busy use GPIO 43/44, so keep logs on native USB.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# H752 has 8 MB octal PSRAM; the e-paper framebuffer prefers PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CONFIG_MESHPAY_BOARD_UNKNOWN is not set
# CONFIG_MESHPAY_BOARD_CYD is not set
# CONFIG_MESHPAY_BOARD_WAVESHARE_S3_TOUCH is not set
CONFIG_MESHPAY_BOARD_LILYGO_T5S3_H752=y
CONFIG_MESHPAY_DAG_MONITOR_ONLY=y

# Production H752 profile is the read-only DAG monitor over the integrated
# SX1262. No ESP-NOW, no wallet node, no transmit path from the app.
# CONFIG_MESHPAY_RADIO_ESPNOW is not set
# CONFIG_MESHPAY_RADIO_LORA_UART is not set
# CONFIG_MESHPAY_RADIO_DISABLED is not set
CONFIG_MESHPAY_RADIO_LORA_CORE1262=y
# CONFIG_MESHPAY_RADIO_ESPNOW_LORA_CORE1262 is not set
CONFIG_MESHPAY_LORA_C1262_SPI_HOST=2
CONFIG_MESHPAY_LORA_C1262_PIN_SCK=18
CONFIG_MESHPAY_LORA_C1262_PIN_MOSI=17
CONFIG_MESHPAY_LORA_C1262_PIN_MISO=8
CONFIG_MESHPAY_LORA_C1262_PIN_NSS=46
CONFIG_MESHPAY_LORA_C1262_PIN_RESET=43
CONFIG_MESHPAY_LORA_C1262_PIN_BUSY=44
CONFIG_MESHPAY_LORA_C1262_PIN_DIO1=3
CONFIG_MESHPAY_LORA_C1262_PIN_RXEN=-1
CONFIG_MESHPAY_LORA_C1262_PIN_TXEN=-1
CONFIG_MESHPAY_LORA_C1262_PIN_AUX_CS=16
CONFIG_MESHPAY_LORA_C1262_FREQUENCY_HZ=868100000
CONFIG_MESHPAY_LORA_C1262_TCXO_CTRL_VOLTAGE=4
CONFIG_MESHPAY_LORA_C1262_CALIBRATE_IMAGE=y
CONFIG_MESHPAY_LORA_C1262_TX_POWER_DBM=14
